大一时学编程的时候有个自己的博客，CSDN的，帐号密码忘了。那年还是的迪奥丝青年，技术菜鸟（现在是高级菜鸟），肚子里没干货，写不出东西。那年写博客是为了能炫耀。顺带一提，大一寒假苦学了一把Java，整整1000页的JavaSE教程，我照着书打了里面70%的代码（很遗憾目前没有了当时的傻劲）。所以我现在跟别人讨论Java还是有底气的。

大二时搞了不少"歪门邪道"。大二初加入了一个技术社团，待了两个星期走人，成果是一个JSP在线相册（很烂，比你现在看到的博客还烂），还有一个小论坛。后对JavaEE厌倦，开始用回JavaSE写点小游戏自娱自乐，殊不知越写越带感，最后去投奔游戏开发。搞游戏那段时间，Direct3D算是入了门吧，现在还能拿一些术语忽悠你。那时花了差不多一个月的时间用D3D写了一个2D游戏框架，最后一次更新统计大概7000+行的样子，里面有参考别人的代码，但不超过100行。后来用这个框架写了个AVG，脚本是Lua，画面勉强能看，演出部分累觉不爱。最后发现自己还是图样，框架的执行效率提升不了，自然而然就放弃维护，现在连代码都找不会来。当然，大二期间还写了很多乱七八糟的代码，多是GUI，黑历史，不提也罢。大二末开始对脚本产生了兴趣，懵懵懂懂就入坑了，Python与Ruby之间选择了前者。为什么？小日本发明的语言为什么要学，管你在Git上开源项目排行多么靠前，我的选择到现在也没有后悔。我的chrome标签栏里有个叫"教程/解决方案"的文件夹，平时搜索到的资料就直接Ctrl-D放进里面，标签数积累到现在已经无法管理了。那时想通过写博纪录错误，但没有这么做，因为我想有个独立博客。

大三开始"改邪归正"，你有姿势了，项目自然而然就找上门了，但我没有参加其中任何一个，水平太菜，怕连累队友。这段时间专业课程数爆发性增多（学校的课程安排与学分制已广受吐槽），故自己能控制的时间少了很多，平时上课时就短短续续地读Django文档（最近写这个博客网站时又复习了一遍），周末就写写爬虫，练练bootstrap，甚是休闲娱乐。选修课中的编译原理让我受益良多，而软件工程这门课本来就挺无聊，老师上课还说讲课要结合实例，之后每节课都讲到他做过的猪场在线管理系统，自此，软件工程课获得养猪工程的美名。大三里习惯linux环境编程，开源的世界让我如鱼得水。转linux后的成果大概就是一个漫画下载器（多任务多线程，下载速度可观，可以到GitHub上获取源码）还有这个独立博客。

稍微展望一下接下来的计划，想写站内搜索工具、聊天机器人、用于每天获取最新业界资讯并发帖的机器人（美其名为游狂吧复兴计划？蛤蛤）、网络论坛框架。毕业设计想写一个Python Web框架，看看到时候自己的能力吧，估计之前还有很多工作要做。

最后拜拜吉多祖师爷，希望自己接下来的编程生涯顺风顺水:-)。

import this
print "enjoy python, have fun"
